# GetChainLengthToOriginal Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
PartUtils..::..GetChainLengthToOriginal Method
PartUtils Class See Also
---
Calculates the length of the longest chain of divisions/merges to reach to an original non-Part element that is the source of the tested part.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public static int GetChainLengthToOriginal(
	Part part
)
```

Visual Basic
---
```text
Public Shared Function GetChainLengthToOriginal ( _
	part As Part _
) As Integer
```

Visual C++
---
```text
public:
static int GetChainLengthToOriginal(
	Part^ part
)
```

# ### Parameters
part
    Type: Autodesk.Revit.DB..::..Part The part to be tested
# ### Return Value
The length of the longest chain.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
PartUtils Class
Autodesk.Revit.DB Namespace